-----------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/jenniferjackson/Desktop/NYU/Large Databases/PS5/NHES data and documen
> tation/JenniferJackson_PS5.log
  log type:  text
 opened on:  19 Mar 2019, 16:50:24

. use "NHES_12_PFI_v1_0_171007172721.dta"

. 
. * PROBLEM 3 ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~        
>                          
. 
. * Convert all variable names to lowercase.
. rename *, lower

. 
. * PROBLEM 4 ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~        
>                          
. 
. * Replace missing data designated as "-1" with "."
. foreach var of varlist homeschlx scpubpri schoicex schrtschl sneighbrx ///
> spubchoix sconsidr sperform s1stchoi seenjoy chisprm par2educ {
  2. recode `var' (-1=.)
  3. }
(homeschlx: 333 changes made)
(scpubpri: 333 changes made)
(schoicex: 1738 changes made)
(schrtschl: 1738 changes made)
(sneighbrx: 333 changes made)
(spubchoix: 333 changes made)
(sconsidr: 333 changes made)
(sperform: 9642 changes made)
(s1stchoi: 333 changes made)
(seenjoy: 333 changes made)
(chisprm: 13356 changes made)
(par2educ: 3806 changes made)

. 
. * PROBLEM 5 ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~        
>                          
. 
. * Recode Yes/No after saving the original variables.
. label define no_label 0 "No" 1 "Yes"

. foreach var of varlist homeschlx schoicex schrtschl sneighbrx spubchoix sconsidr ///
>  sperform s1stchoi chispan camind casian cblack cpaci cwhite hvintrnt {
  2. clonevar `var'_copy = `var'
  3. recode `var'_copy (2=0)
  4. label values `var'_copy no_label
  5. }
(333 missing values generated)
(homeschlx_copy: 13579 changes made)
(1,738 missing values generated)
(schoicex_copy: 1483 changes made)
(1,738 missing values generated)
(schrtschl_copy: 11650 changes made)
(333 missing values generated)
(sneighbrx_copy: 11503 changes made)
(333 missing values generated)
(spubchoix_copy: 5842 changes made)
(333 missing values generated)
(sconsidr_copy: 9309 changes made)
(9,642 missing values generated)
(sperform_copy: 907 changes made)
(333 missing values generated)
(s1stchoi_copy: 2972 changes made)
(chispan_copy: 11106 changes made)
(camind_copy: 13683 changes made)
(casian_copy: 13105 changes made)
(cblack_copy: 11987 changes made)
(cpaci_copy: 13999 changes made)
(cwhite_copy: 3657 changes made)
(hvintrnt_copy: 1604 changes made)

. 
. * PROBLEM 6 ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ 
. global variables "homeschlx schoicex schrtschl sneighbrx spubchoix sconsidr sperform s1
> stchoi chispan camind casian cblack cpaci cwhite hvintrnt"

. foreach vars in variables {
  2. summarize $variables
  3. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   homeschlx |     13,819    1.982633    .1306407          1          2
    schoicex |     12,414    1.119462    .3243443          1          2
   schrtschl |     12,414    1.938457    .2403341          1          2
   sneighbrx |     13,819    1.832405    .3735201          1          2
   spubchoix |     13,819    1.935234    .7570308          1          3
-------------+---------------------------------------------------------
    sconsidr |     13,819    1.673638    .4688985          1          2
    sperform |      4,510    1.201109    .4008735          1          2
    s1stchoi |     13,819    1.215066    .4108831          1          2
     chispan |     14,152    1.784765    .4109995          1          2
      camind |     14,152     1.96686    .1790089          1          2
-------------+---------------------------------------------------------
      casian |     14,152    1.926018    .2617516          1          2
      cblack |     14,152    1.847018    .3599828          1          2
       cpaci |     14,152    1.989189     .103417          1          2
      cwhite |     14,152    1.258409    .4377753          1          2
    hvintrnt |     14,152    1.113341    .3170202          1          2

. 
. tabulate schrtschl

  E5. Charter |
       school |      Freq.     Percent        Cum.
--------------+-----------------------------------
        1 Yes |        764        6.15        6.15
         2 No |     11,650       93.85      100.00
--------------+-----------------------------------
        Total |     12,414      100.00

. * Approximately 6% of the respondents attend charter schools.
. 
. tabulate homeschlx

          E2. |
 Homeschooled |
     for some |
   classes or |
     subjects |      Freq.     Percent        Cum.
--------------+-----------------------------------
        1 Yes |        240        1.74        1.74
         2 No |     13,579       98.26      100.00
--------------+-----------------------------------
        Total |     13,819      100.00

. * Approximately 1% of the respondents are homeschooled.
.                                 
. * PROBLEM 7 ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
. 
. forvalues i = 1/2 {
  2.         summarize fsfreq if csex == `i'
  3.         display r(mean)
  4.         display r(sd)
  5.         summarize age2011 if csex == `i'
  6.         display r(mean)
  7. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      fsfreq |      7,329    7.247237    8.915221         -1         99
7.247237
8.9152212

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     age2011 |      7,329    12.00873    3.862954          4         20
12.008732

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      fsfreq |      6,823    7.265572    8.541025         -1         99
7.2655723
8.5410247

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     age2011 |      6,823    11.96263    3.839026          3         20
11.962626

. 
. * BOYS
. * The average number of meetings was approximately 7.
. * The standard deviation was almost 9 meetings.
. * The average age was 12.
. 
. * GIRLS
. * The average number of meetings was approximately 7.
. * The standard deviation was almost 9 meetings.
. * The average age was 12.
. 
. * PROBLEM 8 ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
. 
. forvalues i = 1/2 {
  2.         foreach var of varlist fsfreq age2011 {
  3.                 summarize `var' if csex == `i'
  4.                 display r(mean)
  5.                 display r(sd)
  6.         }
  7. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      fsfreq |      7,329    7.247237    8.915221         -1         99
7.247237
8.9152212

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     age2011 |      7,329    12.00873    3.862954          4         20
12.008732
3.8629539

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      fsfreq |      6,823    7.265572    8.541025         -1         99
7.2655723
8.5410247

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     age2011 |      6,823    11.96263    3.839026          3         20
11.962626
3.8390262

. 
. * PROBLEM 9 ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
. 
. * Replace any value of fpwt with 10,000 if the weight is greater than 10,000.
. foreach x of varlist fpwt-fpwt80 {
  2.         replace `x' = 10000 if `x' > 10000
  3. }
(503 real changes made)
(513 real changes made)
(513 real changes made)
(514 real changes made)
(517 real changes made)
(511 real changes made)
(509 real changes made)
(508 real changes made)
(517 real changes made)
(505 real changes made)
(513 real changes made)
(510 real changes made)
(506 real changes made)
(509 real changes made)
(508 real changes made)
(512 real changes made)
(510 real changes made)
(509 real changes made)
(509 real changes made)
(505 real changes made)
(513 real changes made)
(507 real changes made)
(504 real changes made)
(511 real changes made)
(512 real changes made)
(515 real changes made)
(514 real changes made)
(512 real changes made)
(508 real changes made)
(505 real changes made)
(510 real changes made)
(510 real changes made)
(509 real changes made)
(513 real changes made)
(510 real changes made)
(507 real changes made)
(501 real changes made)
(506 real changes made)
(506 real changes made)
(510 real changes made)
(510 real changes made)
(513 real changes made)
(512 real changes made)
(514 real changes made)
(508 real changes made)
(515 real changes made)
(511 real changes made)
(510 real changes made)
(507 real changes made)
(516 real changes made)
(507 real changes made)
(505 real changes made)
(512 real changes made)
(511 real changes made)
(510 real changes made)
(514 real changes made)
(514 real changes made)
(510 real changes made)
(505 real changes made)
(507 real changes made)
(507 real changes made)
(505 real changes made)
(511 real changes made)
(510 real changes made)
(512 real changes made)
(508 real changes made)
(509 real changes made)
(511 real changes made)
(509 real changes made)
(504 real changes made)
(515 real changes made)
(513 real changes made)
(508 real changes made)
(510 real changes made)
(507 real changes made)
(508 real changes made)
(511 real changes made)
(504 real changes made)
(507 real changes made)
(510 real changes made)
(509 real changes made)

. 
. * Still cannot get this one to work. >.<
. * global y "fpwt1-fpwt80"
. * gen weight_label = " "
. * forvalues j = 1/80 {
. *       replace `y' = "Replicate Weight "+`j'
. * }
.  
. 
. * PROBLEM 10 ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~       
>                          
. 
. regress fsfreq i.par1educ

      Source |       SS           df       MS      Number of obs   =    14,152
-------------+----------------------------------   F(4, 14147)     =    152.11
       Model |   44537.866         4  11134.4665   Prob > F        =    0.0000
    Residual |  1035560.11    14,147  73.1999796   R-squared       =    0.0412
-------------+----------------------------------   Adj R-squared   =    0.0410
       Total |  1080097.98    14,151  76.3266184   Root MSE        =    8.5557

----------------------------------------------------------------------------------------
                fsfreq |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
              par1educ |
2 High school gradu..  |   1.575764   .2930384     5.38   0.000     1.001371    2.150158
3 Vocational/techni..  |    3.07219   .2631428    11.67   0.000     2.556395    3.587984
   4 College graduate  |   5.393726   .2818124    19.14   0.000     4.841337    5.946116
5 Graduate or profe..  |   5.230168   .2841833    18.40   0.000     4.673131    5.787205
                       |
                 _cons |   3.826923   .2326843    16.45   0.000     3.370831    4.283015
----------------------------------------------------------------------------------------

. 
. tabulate par1educ, generate(ed_level)

   D-Educational attainment of child's |
                    parent or guardian |      Freq.     Percent        Cum.
---------------------------------------+-----------------------------------
    1 Less than high school credential |      1,352        9.55        9.55
  2 High school graduate or equivalent |      2,307       16.30       25.86
3 Vocational/technical school after HS |      4,847       34.25       60.10
                    4 College graduate |      2,896       20.46       80.57
     5 Graduate or professional school |      2,750       19.43      100.00
---------------------------------------+-----------------------------------
                                 Total |     14,152      100.00

. 
. * Approximately 4% of the variability among frequency of school meeting
. * attendance is explained by the education level of the child's "first" parent.
. 
. regress fsfreq i.ed_level2 /* R^2 = 0.0088 */

      Source |       SS           df       MS      Number of obs   =    14,152
-------------+----------------------------------   F(1, 14150)     =    125.14
       Model |  9468.11888         1  9468.11888   Prob > F        =    0.0000
    Residual |  1070629.86    14,150  75.6628875   R-squared       =    0.0088
-------------+----------------------------------   Adj R-squared   =    0.0087
       Total |  1080097.98    14,151  76.3266184   Root MSE        =    8.6984

------------------------------------------------------------------------------
      fsfreq |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 1.ed_level2 |  -2.214366   .1979516   -11.19   0.000    -2.602377   -1.826355
       _cons |   7.617054   .0799234    95.30   0.000     7.460393    7.773714
------------------------------------------------------------------------------

. regress fsfreq i.ed_level3 /* R^2 = 0.0009 */

      Source |       SS           df       MS      Number of obs   =    14,152
-------------+----------------------------------   F(1, 14150)     =     12.32
       Model |  939.341187         1  939.341187   Prob > F        =    0.0005
    Residual |  1079158.64    14,150   76.265628   R-squared       =    0.0009
-------------+----------------------------------   Adj R-squared   =    0.0008
       Total |  1080097.98    14,151  76.3266184   Root MSE        =     8.733

------------------------------------------------------------------------------
      fsfreq |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 1.ed_level3 |  -.5429076   .1546958    -3.51   0.000    -.8461318   -.2396834
       _cons |    7.44202   .0905329    82.20   0.000     7.264564    7.619477
------------------------------------------------------------------------------

. regress fsfreq i.ed_level4 /* R^2 = 0.0130 */

      Source |       SS           df       MS      Number of obs   =    14,152
-------------+----------------------------------   F(1, 14150)     =    186.53
       Model |  14052.9766         1  14052.9766   Prob > F        =    0.0000
    Residual |     1066045    14,150  75.3388693   R-squared       =    0.0130
-------------+----------------------------------   Adj R-squared   =    0.0129
       Total |  1080097.98    14,151  76.3266184   Root MSE        =    8.6798

------------------------------------------------------------------------------
      fsfreq |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 1.ed_level4 |   2.470027   .1808536    13.66   0.000      2.11553    2.824524
       _cons |   6.750622   .0818121    82.51   0.000     6.590259    6.910984
------------------------------------------------------------------------------

. regress fsfreq i.ed_level5 /* R^2 = 0.0103 */

      Source |       SS           df       MS      Number of obs   =    14,152
-------------+----------------------------------   F(1, 14150)     =    146.55
       Model |  11071.4287         1  11071.4287   Prob > F        =    0.0000
    Residual |  1069026.55    14,150  75.5495794   R-squared       =    0.0103
-------------+----------------------------------   Adj R-squared   =    0.0102
       Total |  1080097.98    14,151  76.3266184   Root MSE        =    8.6919

------------------------------------------------------------------------------
      fsfreq |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 1.ed_level5 |   2.235393    .184658    12.11   0.000     1.873439    2.597347
       _cons |   6.821698   .0814002    83.80   0.000     6.662143    6.981253
------------------------------------------------------------------------------

. 
. * After running regression analysis on each individulal level of education, it
. * seems that for level 4 - college graduated parents - there is a slightly
. * larger amount of variance among school meeting attendance explained by this
. * education level.
. 
. * PROBLEM 11 ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~       
>                          
. 
. 
. save NHES_lastedit_16March2019.dta
file NHES_lastedit_16March2019.dta saved

. 
. log close
      name:  <unnamed>
       log:  /Users/jenniferjackson/Desktop/NYU/Large Databases/PS5/NHES data and documen
> tation/JenniferJackson_PS5.log
  log type:  text
 closed on:  19 Mar 2019, 16:50:25
-----------------------------------------------------------------------------------------
